TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    bool isOnNodeScreen() { return currentScreen == ScreenId::NODE_NETWORK; }

    // RGB panel handle — the screenshot server reads its PSRAM framebuffer.
    esp_lcd_panel_handle_t lcdPanel() const { return _lcdPanel; }

    // Called by main.cpp when the nightly OTA check finds a newer version.
    // Creates a small persistent badge at the bottom of the screen. Tapping
    // it opens a confirm dialog; on confirm, onOtaInstallConfirmed is called.
    void showOtaBadge(const char* version) {
        clearOtaBadge(); // remove any existing one first

        _otaBadge = lv_obj_create(lv_layer_top()); // layer_top() floats over all screens
        lv_obj_set_size(_otaBadge, LV_PCT(100), 42);
        lv_obj_align(_otaBadge, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(_otaBadge, lv_color_hex(0x1c2c1c), 0);
        lv_obj_set_style_border_color(_otaBadge, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_border_width(_otaBadge, 1, 0);
        lv_obj_set_style_border_side(_otaBadge, LV_BORDER_SIDE_TOP, 0);
        lv_obj_set_style_pad_all(_otaBadge, 0, 0);
        lv_obj_add_flag(_otaBadge, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t* label = lv_label_create(_otaBadge);
        char text[48];
        snprintf(text, sizeof(text), "\xEF\x81\xB7 Firmware %s available, tap to install", version);
        lv_label_set_text(label, text);
        lv_obj_set_style_text_color(label, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(label, &lv_font_montserrat_12, 0);
        lv_obj_center(label);

        // Store version string in badge's user_data so the callback can show it
        static char versionBuf[24];
        strncpy(versionBuf, version, sizeof(versionBuf) - 1);
        lv_obj_set_user_data(_otaBadge, versionBuf);
        lv_obj_add_event_cb(_otaBadge, onOtaBadgeTapped, LV_EVENT_CLICKED, this);
    }

    void clearOtaBadge() {
        if (_otaBadge) { lv_obj_del(_otaBadge); _otaBadge = nullptr; }
    }

    // Set by the config popup's "Check for updates" button; the main loop polls
    // it, runs the OTA check on the network thread, and then either shows the
    // install badge (update found) or a transient "up to date" bar.
    volatile bool otaCheckRequested = false;

    // Transient bottom bar for a one-off OTA message (auto-dismisses ~4 s). Not
    // shown if an install badge is already up.
    void showOtaInfo(const char* msg) {
        if (_otaBadge) return;
        lv_obj_t* bar = lv_obj_create(lv_layer_top());
        lv_obj_set_size(bar, LV_PCT(100), 40);
        lv_obj_align(bar, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(bar, lv_color_hex(0x141414), 0);
        lv_obj_set_style_border_color(bar, lv_color_hex(0x3a3a3a), 0);
        lv_obj_set_style_border_width(bar, 1, 0);
        lv_obj_set_style_border_side(bar, LV_BORDER_SIDE_TOP, 0);
        lv_obj_t* l = lv_label_create(bar);
        lv_label_set_text(l, msg);
        lv_obj_set_style_text_color(l, lv_color_hex(0xd8d8dc), 0);
        lv_obj_set_style_text_font(l, &lv_font_montserrat_12, 0);
        lv_obj_center(l);
        lv_timer_t* t = lv_timer_create([](lv_timer_t* tm) {
            lv_obj_t* b = (lv_obj_t*)tm->user_data;
            if (b) lv_obj_del(b);
            lv_timer_del(tm);
        }, 4000, bar);
        lv_timer_set_repeat_count(t, 1);
    }

    // Set this before begin(). Called when user confirms "Install".
    std::function<void()> onOtaInstallConfirmed;

    // ── NFT fullscreen ("digital photo frame") ────────────────────────────────
    // A double-press of the top button toggles it — but only while the NFT
    // screen is showing (or to exit once you're in it). main.cpp only routes a
    // double-press to us when nftDoublePressActive() is true.
    bool _nftFullscreen = false;
    bool nftDoublePressActive() const { return currentScreen == ScreenId::NFT || _nftFullscreen; }
    void toggleNftFullscreen() {
        if (currentScreen != ScreenId::NFT && !_nftFullscreen) return;
        _nftFullscreen = !_nftFullscreen;
        nftScreen.setFullscreen(_nftFullscreen);
    }

    bool miningFeedNeedsRefresh() {
        uint32_t now = millis();
        if (now - lastMiningFeedFetch < MINING_FEED_REFRESH_MS) return false;
        lastMiningFeedFetch = now;
        return true;
    }

    // A failed feed fetch shouldn't cost the whole refresh window — pull the
    // next attempt in to ~3 s so a transient TLS/memory hiccup self-heals fast.
    void retryMiningFeedSoon() {
        lastMiningFeedFetch = millis() - MINING_FEED_REFRESH_MS + 3000;
    }

    void updateTreasuryData(const TreasuryData& data) {
        latestTreasury = data;
        turboScreen.updateData(data);
    }

    void loadOhlcvChart(OhlcvCandle* candles, int count) {
        turboScreen.loadRealCandles(candles, count, turboGroupDays());
    }

    // Turbo chart timeframe (1D/1W/1M dropdown) → candle grouping for
    // fetchOhlcvHistory(). 12 monthly bars keep the GT daily fetch at 360 rows.
    int turboGroupDays() { return turboScreen.timeframeSel == 0 ? 1 : (turboScreen.timeframeSel == 1 ? 7 : 30); }
    int turboBars()      { return turboScreen.timeframeSel == 2 ? 12 : 26; }
    bool turboTfConsumeDirty() {
        if (!turboScreen.tfDirty) return false;
        turboScreen.tfDirty = false;
        return true;
    }

    // Retry hook for main.cpp: true once the debt chart has real data.
    bool debtHistLoaded() const { return _debtHistLoaded; }
    void retryDebtHistory() {
        static const int yearValues[] = {5, 10, 20, 30, 50, 75};
        reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
    }

    // Live TUSD price from DexScreener/GeckoTerminal (independent of the
    // treasury service, which may be down / not deployed).
    void updateTusdPrice(double priceUsd) {
        turboScreen.updatePrice(priceUsd);
    }

    void updateDebtData(const DebtData& data) {
        latestDebt = data;
        debtScreen.updateLiveTotal(data.totalDebtUsd);
        // Load the historical chart + SINCE/RATE once, on the first live total.
        if (!_debtHistLoaded) {
            static const int yearValues[] = {5, 10, 20, 30, 50, 75};
            reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
        }
    }

    // Re-apply screen order/visibility after a heartbeat config sync (the
    // web's eye toggles otherwise only took effect after a reboot).
    void reloadScreenOrder() { _loadScreenOrder(); }

    void updateLeaderboard(LeaderboardEntry* entries, int count) {
        nodeScreen.updateLeaderboard(entries, count);
        // The footers' "| N NODES" counter feeds off the same directory data
        // (it used to sit at 0 forever — nothing ever set it).
        int online = 0;
        for (int i = 0; i < count; i++) if (entries[i].online) online++;
        _onlineNodeCount = online;
    }

    void updateMiningFeed(MiningFeedEntry* entries, int count) {
        nodeScreen.updateMiningFeed(entries, count);
        // Remember when the countdown started, for the per-second ring/strip:
        // preferred = the pending block's created_at; fallback (same rule the
        // web uses, and what keeps this working if the DB view lacks
        // created_at) = the newest mined block's mined_at.
        time_t newestMined = 0;
        for (int i = 0; i < count; i++) {
            if (entries[i].mined && entries[i].minedAtUtc > newestMined)
                newestMined = entries[i].minedAtUtc;
            if (!entries[i].mined) {
                if (entries[i].createdAtUtc > 0) _pendingBlockCreatedAt = entries[i].createdAtUtc;
                _pendingBlockReward = entries[i].rewardTusd > 0 ? entries[i].rewardTusd : 100.0;
            }
        }
        if (_pendingBlockCreatedAt == 0 && newestMined > 0)
            _pendingBlockCreatedAt = newestMined;
    }

    // Called from the main loop after a successful RP2040 sensor poll. The new
    // values appear on the next per-second header/Home refresh, so there's no
    // need to redraw here.
    void updateAmbient(float tempC, int humidityPct) {
        _tempC = tempC;
        _humidityPct = humidityPct;
        _sensorValid = true;
    }

    // Called when a sensor poll fails (link down, or no AHT20 plugged in).
    // Drops back to showing "--" rather than a stale reading.
    void markAmbientUnavailable() {
        _sensorValid = false;
    }

    void showAlarmFiringOverlay() {
        // The alarm must ALWAYS light the screen — wake it from the
        // button-off state and from the idle-timeout state, and reset the
        // inactivity timer so it doesn't blank again mid-ring.
        _screenOn    = true;
        _screenIsOn  = true;
        _lastTouchMs = millis();
        applyStoredBrightness();

        lv_obj_t* overlay = lv_obj_create(lv_scr_act());
        lv_obj_set_size(overlay, LV_PCT(100), LV_PCT(100));
        lv_obj_set_style_bg_color(overlay, lv_color_hex(ALARM_GREEN), 0);
        lv_obj_set_style_border_width(overlay, 0, 0);
        lv_obj_set_style_pad_all(overlay, 0, 0);
        lv_obj_clear_flag(overlay, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_center(overlay);

        // Big "TURBO ALARM!" filling the background, repeated, flashing.
        lv_obj_t* bgText = lv_label_create(overlay);
        lv_label_set_text(bgText,
            "TURBO ALARM!\nTURBO ALARM!\nTURBO ALARM!\nTURBO ALARM!\nTURBO ALARM!\nTURBO ALARM!");
        lv_obj_set_style_text_font(bgText, &lv_font_montserrat_32, 0);
        lv_obj_set_style_text_align(bgText, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_set_style_text_line_space(bgText, 16, 0);
        lv_obj_set_style_text_color(bgText, lv_color_hex(0xffffff), 0);
        lv_obj_center(bgText);

        lv_obj_t* stopBtn = lv_btn_create(overlay);
        lv_obj_set_size(stopBtn, 190, 74);
        lv_obj_set_style_radius(stopBtn, 37, 0);
        lv_obj_set_style_bg_color(stopBtn, lv_color_hex(0xffffff), 0);
        lv_obj_set_style_border_width(stopBtn, 3, 0);
        lv_obj_set_style_border_color(stopBtn, lv_color_hex(0x000000), 0);
        lv_obj_set_style_shadow_width(stopBtn, 24, 0);
        lv_obj_set_style_shadow_color(stopBtn, lv_color_hex(0x000000), 0);
        lv_obj_set_style_shadow_opa(stopBtn, LV_OPA_40, 0);
        lv_obj_center(stopBtn);
        lv_obj_add_event_cb(stopBtn, [](lv_event_t* e) {
            UiManager* self = (UiManager*)lv_event_get_user_data(e);
            self->dismissAlarmOverlay();
        }, LV_EVENT_CLICKED, this);
        lv_obj_t* stopLabel = lv_label_create(stopBtn);
        lv_label_set_text(stopLabel, "STOP");
        lv_obj_set_style_text_font(stopLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_color(stopLabel, lv_color_hex(0x000000), 0);
        lv_obj_center(stopLabel);

        alarmOverlay      = overlay;
        _alarmBgText      = bgText;
        _alarmStopBtn     = stopBtn;
        _alarmStopLbl     = stopLabel;
        _alarmBlinkPhase  = 0;
        // Blink green ↔ full white ~2x/s so it's unmissable in a dark room.
        _alarmBlinkTimer  = lv_timer_create(_alarmBlinkCb, 430, this);
    }

    // Alarm-overlay blink: alternate green ↔ white, flipping the big text and the
    // STOP button so they stay legible on either background.
    static void _alarmBlinkCb(lv_timer_t* t) {
        UiManager* self = (UiManager*)t->user_data;
        if (!self || !self->alarmOverlay) return;
        self->_alarmBlinkPhase ^= 1;
        bool green = (self->_alarmBlinkPhase == 0);
        uint32_t bg    = green ? ALARM_GREEN : 0xffffff;
        uint32_t big   = green ? 0xffffff    : ALARM_GREEN;
        uint32_t btnBg = green ? 0xffffff    : ALARM_GREEN;
        uint32_t btnFg = green ? 0x000000    : 0xffffff;
        lv_obj_set_style_bg_color(self->alarmOverlay, lv_color_hex(bg), 0);
        if (self->_alarmBgText)  lv_obj_set_style_text_color(self->_alarmBgText, lv_color_hex(big), 0);
        if (self->_alarmStopBtn) {
            lv_obj_set_style_bg_color(self->_alarmStopBtn, lv_color_hex(btnBg), 0);
            lv_obj_set_style_border_color(self->_alarmStopBtn, lv_color_hex(btnFg), 0);
        }
        if (self->_alarmStopLbl) lv_obj_set_style_text_color(self->_alarmStopLbl, lv_color_hex(btnFg), 0);
    }

    std::function<void()> onAlarmDismissed;

    // True while the yellow "alarm firing" overlay is up (i.e. the user hasn't
    // tapped STOP yet). main.cpp uses this to periodically re-send PLAY_ALARM
    // to the RP2040, so one lost UART frame can't result in a silent alarm.
    bool isAlarmOverlayActive() const { return alarmOverlay != nullptr; }

    // Public entry point for the physical top button: stop the ringing alarm
    // exactly like tapping the on-screen STOP.
    void stopRingingAlarm() { dismissAlarmOverlay(); }

