TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    // Called from the touch input driver whenever the screen is physically touched.
    // Resets the inactivity timer and wakes the backlight if it was off.
    void _onTouchActivity() {
        _lastTouchMs  = millis();
        if (!_screenIsOn) {
            _screenIsOn = true;
            applyStoredBrightness();
        }
    }

    // Checked every loop() tick. Turns off the backlight after the configured
    // idle period when always-on mode is disabled.
    void _checkScreenTimeout() {
        if (storage.getScreenAlwaysOn()) return;
        uint32_t timeoutMs = (uint32_t)storage.getScreenTimeoutMins() * 60UL * 1000UL;
        if (_screenIsOn && (millis() - _lastTouchMs > timeoutMs)) {
            _screenIsOn = false;
            ledcWrite(LCD_PIN_BL, 0);  // channel 0 = backlight
        }
    }

private:
    ScreenId currentScreen = ScreenId::CLOCK;
    lv_obj_t* screens[(int)ScreenId::COUNT] = { nullptr };
    lv_obj_t* alarmOverlay = nullptr;
    // Alarm overlay blink (green ↔ white) + big "TURBO ALARM!" background.
    static constexpr uint32_t ALARM_GREEN = 0x43e397;   // matches the clock digits
    lv_obj_t*    _alarmBgText     = nullptr;
    lv_obj_t*    _alarmStopBtn    = nullptr;
    lv_obj_t*    _alarmStopLbl    = nullptr;
    lv_timer_t*  _alarmBlinkTimer = nullptr;
    uint8_t      _alarmBlinkPhase = 0;

    // Screen timeout state
    uint32_t _lastTouchMs = 0;     // millis() of the last touch event
    bool     _screenIsOn  = true;  // false while backlight is off due to timeout

    // Swipe order: _swipeOrder[swipe_pos] = ScreenId value.
    // Default (matches the intended UX order):
    //   pos 0 → CLOCK(0)        Home
    //   pos 1 → TURBO_STATS(1)  Price/chart
    //   pos 2 → TICKERS(6)      Token screener  ← screen 3 (user-facing)
    //   pos 3 → DEBT(2)         US debt
    //   pos 4 → INFLATION_GAME(3) Inflation calculator
    //   pos 5 → NFT(5)          NFT gallery     ← penultimate
    //   pos 6 → NODE_NETWORK(4) Node status     ← last
    // Can be overridden per-device from NVS (set via web setup page). Position 0 is always CLOCK.
    uint8_t _swipeOrder[(int)ScreenId::COUNT] = { 0, 1, 6, 2, 3, 5, 4 };
    int     _swipeCount = (int)ScreenId::COUNT;   // visible screens (hidden ones filtered out)
    int     _currentSwipePos = 0;
    uint32_t _carouselLastMs = 0;                 // last screen change (manual or auto); gates the carousel

    // Swipe-vs-tap disambiguation. The touch read_cb records where a press
    // started and, if the finger travels past TAP_SLOP_PX before release, marks
    // the whole gesture as a swipe. Popup-opening handlers (alarm, calendar,
    // gear, …) consult _touchWasSwipe and bail, so a swipe that HAPPENS to start
    // on an icon no longer also fires that icon's click — which used to open the
    // popup on the screen you just swiped to. LVGL doesn't cancel CLICKED on
    // movement by itself (the icons aren't in a scrollable container), so we
    // gate it explicitly here.
    static constexpr lv_coord_t TAP_SLOP_PX = 22;
    bool       _pressActive  = false;
    bool       _touchWasSwipe = false;
    lv_coord_t _pressStartX  = 0;
    lv_coord_t _pressStartY  = 0;

    TurboScreen  turboScreen;
    DebtScreen   debtScreen;
    GameScreen   gameScreen;
    NodeScreen   nodeScreen;
    TickerScreen tickerScreen;
    NftScreen    nftScreen;

    TreasuryData latestTreasury;
    DebtData latestDebt;
    uint32_t lastMiningFeedFetch = 0;

    esp_lcd_panel_handle_t _lcdPanel = nullptr;
    lv_obj_t* _otaBadge = nullptr;

    // TCA9535 IO expander output shadow registers (one byte per 8-pin port).
    // We must track current output state to do single-pin set/clear, since
    // the TCA9535 write register takes the full port byte each time.
    uint8_t _expanderPort0 = 0xFF;  // all pins high by default
    uint8_t _expanderPort1 = 0xFF;

    int debtYearsRangeIndex = 4;
    int sincePeriodIndex = 4;
    int rateUnitIndex = 0;
    int gameYearsIndex = 0;            // 0 = REAL TIME (default), then 1Y…100Y
    bool   _gameRtActive   = false;    // real-time game mode currently driving the chart
    double _gameRtBaseline = 0.0;      // dollar value mapped to chart unit 0
    int    _gameRtCount    = 0;        // points drawn so far (fill phase: left → right)
    double _debtPerSecond = 0.0;   // US-debt-clock rate, derived from history
    bool   _debtHistLoaded = false;
    bool   _debtRangeDirty = false; // range picker changed → refetch history (debounced)
    time_t _pendingBlockCreatedAt = 0;   // pending mining block opened at (UTC)
    double _pendingBlockReward    = 100.0;
    double _annualDebasementRate = 0.08;  // yearly $ debasement for the inflation game,
                                          // derived from real debt growth (fallback 8%)

    lv_obj_t* clockTimeLabel = nullptr;
    lv_obj_t* clockDateLabel = nullptr;
    lv_obj_t* clockAlarmLabel = nullptr;
    lv_obj_t* clockWeatherLabel = nullptr;  // "23° · 48%" line on the Home screen
    uint32_t lastClockRedrawSecond = 255;
    SharedFooterRefs clockFooterRefs;

    // Ambient readings from the AHT20 on the RP2040 (polled over UART in the
    // main loop). _sensorValid is false until the first good read, or whenever
    // a read fails — the UI then shows "--" instead of a stale/zero value.
    float _tempC        = 0.0f;
    int   _humidityPct  = 0;
    bool  _sensorValid  = false;

    bool  _screenOn     = true;   // user-button screen toggle state
    int   _onlineNodeCount = 0;   // total online nodes in the network (footer "| N NODES")

    // ── Screen swipe order ───────────────────────────────────────────────────

    // Load the user-defined swipe order from NVS.
    // Format: comma-separated ScreenId integers, e.g. "0,4,1,2,3,5,6".
    // Position 0 must always be 0 (CLOCK/Home) — enforced here.
    // Falls back to the default 0,1,2,3,4,5,6 if NVS entry is absent/malformed.
    void _loadScreenOrder() {
        String stored = storage.getScreenOrder();
        if (stored.length() == 0) return;   // use default array initialiser values

        uint8_t tmp[(int)ScreenId::COUNT];
        int pos = 0;
        int idx = 0;
        int len = stored.length();

        while (idx < len && pos < (int)ScreenId::COUNT) {
            int sep = stored.indexOf(',', idx);
            if (sep < 0) sep = len;
            int val = stored.substring(idx, sep).toInt();
            if (val >= 0 && val < (int)ScreenId::COUNT) {
                tmp[pos++] = (uint8_t)val;
            }
            idx = sep + 1;
        }

        // Only apply if we got exactly COUNT entries and position 0 is CLOCK
        if (pos == (int)ScreenId::COUNT && tmp[0] == (uint8_t)ScreenId::CLOCK) {
            memcpy(_swipeOrder, tmp, sizeof(_swipeOrder));
        }
        _applyHiddenScreens();
    }

    // Drop hidden screens (web setup "eye" toggles / screen_hidden CSV) from
    // the rotation. Home/CLOCK can never be hidden.
    void _applyHiddenScreens() {
        String hid = storage.getScreenHidden();
        uint8_t filtered[(int)ScreenId::COUNT];
        int fc = 0;
        for (int i = 0; i < (int)ScreenId::COUNT; i++) {
            uint8_t id = _swipeOrder[i];
            bool hidden = false;
            if (id != (uint8_t)ScreenId::CLOCK && hid.length()) {
                int idx2 = 0, len = hid.length();
                while (idx2 < len) {
                    int sep = hid.indexOf(',', idx2);
                    if (sep < 0) sep = len;
                    if (hid.substring(idx2, sep).toInt() == (int)id) { hidden = true; break; }
                    idx2 = sep + 1;
                }
            }
            if (!hidden) filtered[fc++] = id;
        }
        if (fc < 1) { filtered[0] = (uint8_t)ScreenId::CLOCK; fc = 1; }
        memcpy(_swipeOrder, filtered, fc);
        _swipeCount = fc;
        if (_currentSwipePos >= _swipeCount) _currentSwipePos = 0;
    }

    // ── TCA9535 helpers ──────────────────────────────────────────────────────

    // Write one byte to a TCA9535 register over I2C.
    void expanderWriteReg(uint8_t reg, uint8_t val) {
        Wire.beginTransmission(IO_EXPANDER_I2C_ADDR);
        Wire.write(reg);
        Wire.write(val);
        Wire.endTransmission();
    }

    // Set or clear a single IO expander pin, preserving all other pin states.
    // Pins 0-7 → port 0; pins 8-15 → port 1.
    void expanderSetPin(uint8_t pin, uint8_t level) {
        if (pin < 8) {
            if (level) _expanderPort0 |=  (1u << pin);
            else       _expanderPort0 &= ~(1u << pin);
            expanderWriteReg(0x02, _expanderPort0);  // output port 0
        } else {
            uint8_t bit = pin - 8;
            if (level) _expanderPort1 |=  (1u << bit);
            else       _expanderPort1 &= ~(1u << bit);
            expanderWriteReg(0x03, _expanderPort1);  // output port 1
        }
    }

    // ── ST7701S bit-bang SPI ─────────────────────────────────────────────────
    // Protocol: 9-bit frames, MSB first (bit 8 = D/CX: 0=cmd, 1=data).
    // CS is driven through the IO expander; CLK and MOSI are direct GPIOs.
    // Faithfully ported from Seeed's SPI_SendData / SPI_WriteComm / SPI_WriteData
    // in components/bsp/src/boards/lcd_panel_config.c.

    void st7701sSpiSend9(uint16_t bits9) {
        for (int n = 0; n < 9; n++) {
            digitalWrite(LCD_SPI_MOSI, (bits9 & 0x0100) ? HIGH : LOW);
            bits9 <<= 1;
            digitalWrite(LCD_SPI_CLK, HIGH);
            delayMicroseconds(10);
            digitalWrite(LCD_SPI_CLK, LOW);
            delayMicroseconds(10);
        }
    }

    // Send a command byte (D/CX = 0). Matches Seeed's SPI_WriteComm() exactly:
    // two CS-framed 9-bit transactions — the first carries the high byte of a
    // 16-bit command address (always 0 for the ST7701S's single-byte commands),
    // the second carries the actual command byte with D/CX = 0.
    void st7701sCmd(uint8_t cmd) {
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        st7701sSpiSend9(((uint16_t)(cmd >> 8) & 0xFF) | 0x2000u);
        digitalWrite(LCD_SPI_CLK, HIGH);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        st7701sSpiSend9((uint16_t)(cmd & 0xFF));  // D/CX = bit8 = 0 (command)
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
    }

    // Send a data byte (D/CX = 1). Matches Seeed's SPI_WriteData().
    void st7701sData(uint8_t data) {
        uint16_t bits9 = ((uint16_t)(data & 0xFF)) | 0x0100u;  // D/CX = 1
        expanderSetPin(EXPANDER_PIN_LCD_CS, 0);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        st7701sSpiSend9(bits9);
        digitalWrite(LCD_SPI_CLK, HIGH);
        delayMicroseconds(10);
        digitalWrite(LCD_SPI_CLK, LOW);
        delayMicroseconds(10);
        expanderSetPin(EXPANDER_PIN_LCD_CS, 1);
        delayMicroseconds(10);
    }

    // Full ST7701S initialisation sequence for the D1's GX 4.0-inch panel.
    // Copied verbatim from Seeed's lcd_panel_st7701s_init() in lcd_panel_config.c,
    // translated to st7701sCmd() / st7701sData() calls.
    void st7701sInit() {
        // Page 0 (manufacturer command enable)
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x10);

        st7701sCmd(0xC0); st7701sData(0x3B); st7701sData(0x00);  // 480×480
        st7701sCmd(0xC1); st7701sData(0x0D); st7701sData(0x02);
        st7701sCmd(0xC2); st7701sData(0x31); st7701sData(0x05);
        st7701sCmd(0xC7); st7701sData(0x04);
        st7701sCmd(0xCD); st7701sData(0x08);

        // Positive gamma
        st7701sCmd(0xB0);
        st7701sData(0x00); st7701sData(0x11); st7701sData(0x18); st7701sData(0x0E);
        st7701sData(0x11); st7701sData(0x06); st7701sData(0x07); st7701sData(0x08);
        st7701sData(0x07); st7701sData(0x22); st7701sData(0x04); st7701sData(0x12);
        st7701sData(0x0F); st7701sData(0xAA); st7701sData(0x31); st7701sData(0x18);

        // Negative gamma
        st7701sCmd(0xB1);
        st7701sData(0x00); st7701sData(0x11); st7701sData(0x19); st7701sData(0x0E);
        st7701sData(0x12); st7701sData(0x07); st7701sData(0x08); st7701sData(0x08);
        st7701sData(0x08); st7701sData(0x22); st7701sData(0x04); st7701sData(0x11);
        st7701sData(0x11); st7701sData(0xA9); st7701sData(0x32); st7701sData(0x18);

        // Page 1
        st7701sCmd(0xFF); st7701sData(0x77); st7701sData(0x01);
        st7701sData(0x00); st7701sData(0x00); st7701sData(0x11);

        st7701sCmd(0xB0); st7701sData(0x60);
        st7701sCmd(0xB1); st7701sData(0x32);
        st7701sCmd(0xB2); st7701sData(0x07);
        st7701sCmd(0xB3); st7701sData(0x80);
        st7701sCmd(0xB5); st7701sData(0x49);
        st7701sCmd(0xB7); st7701sData(0x85);
        st7701sCmd(0xB8); st7701sData(0x21);
        st7701sCmd(0xC1); st7701sData(0x78);
        st7701sCmd(0xC2); st7701sData(0x78);

        delay(20);

