TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // 11. Enable backlight via LEDC PWM (GPIO 45, active HIGH).
        //     5 kHz / 8-bit resolution gives smooth dimming with no audible whine.
        //     Arduino-ESP32 3.x API: ledcAttach(pin, freq, bits) sets it up AND
        //     binds it in one call; PWM is then addressed by PIN, not channel
        //     (so every ledcWrite() below uses LCD_PIN_BL, not a channel index).
        ledcAttach(LCD_PIN_BL, 5000, 8);
        applyStoredBrightness();
    }

    void dismissAlarmOverlay() {
        if (_alarmBlinkTimer) { lv_timer_del(_alarmBlinkTimer); _alarmBlinkTimer = nullptr; }
        if (alarmOverlay) { lv_obj_del(alarmOverlay); alarmOverlay = nullptr; }
        _alarmBgText = _alarmStopBtn = _alarmStopLbl = nullptr;
        if (onAlarmDismissed) onAlarmDismissed();
    }

    void buildAllScreens() {
        screens[(int)ScreenId::CLOCK] = buildClockScreen();

        screens[(int)ScreenId::TURBO_STATS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TURBO_STATS], lv_color_black(), 0);
        turboScreen.build(screens[(int)ScreenId::TURBO_STATS], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(turboScreen.header);
        _wireFooterNav(turboScreen.footer);

        screens[(int)ScreenId::DEBT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::DEBT], lv_color_black(), 0);
        debtScreen.build(screens[(int)ScreenId::DEBT], onLogoTapped, onDateTapped, onQrTapped,
                          onDebtRangeTapped, onSinceBtnTapped, onRateBtnTapped, this);
        _wireAlarmIcon(debtScreen.header);
        _wireFooterNav(debtScreen.footer);

        screens[(int)ScreenId::INFLATION_GAME] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::INFLATION_GAME], lv_color_black(), 0);
        gameScreen.build(screens[(int)ScreenId::INFLATION_GAME], onLogoTapped, onDateTapped, onQrTapped, onGameYearsTapped, this);
        _wireAlarmIcon(gameScreen.header);
        _wireFooterNav(gameScreen.footer);

        screens[(int)ScreenId::NODE_NETWORK] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NODE_NETWORK], lv_color_black(), 0);
        nodeScreen.build(screens[(int)ScreenId::NODE_NETWORK], onLogoTapped, onDateTapped, onQrTapped, onVerifyBadgeTapped, this);
        _wireAlarmIcon(nodeScreen.header);
        _wireFooterNav(nodeScreen.footer);

        screens[(int)ScreenId::NFT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NFT], lv_color_black(), 0);
        nftScreen.build(screens[(int)ScreenId::NFT], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(nftScreen.header);
        _wireFooterNav(nftScreen.footer);

        screens[(int)ScreenId::TICKERS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TICKERS], lv_color_black(), 0);
        tickerScreen.build(screens[(int)ScreenId::TICKERS], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(tickerScreen.header);
        _wireFooterNav(tickerScreen.footer);
        TickerScreen::s_instance = &tickerScreen;
        lv_timer_create(TickerScreen::pollPending, 100, &tickerScreen);

        attachSwipeGesture(screens[(int)ScreenId::CLOCK]);
        attachSwipeGesture(screens[(int)ScreenId::TURBO_STATS]);
        attachSwipeGesture(screens[(int)ScreenId::DEBT]);
        attachSwipeGesture(screens[(int)ScreenId::INFLATION_GAME]);
        attachSwipeGesture(screens[(int)ScreenId::NODE_NETWORK]);
        attachSwipeGesture(screens[(int)ScreenId::NFT]);
        attachSwipeGesture(screens[(int)ScreenId::TICKERS]);
    }

    // Footer navigation: tapping the node name/ID, the separator or the
    // "N NODES" counter jumps straight to the Network screen.
    void _wireFooterNav(SharedFooterRefs& ftr) {
        lv_obj_t* targets[3] = { ftr.nodeNameLabel, ftr.nodeSepLabel, ftr.nodeCountLabel };
        for (int i = 0; i < 3; i++) {
            if (!targets[i]) continue;
            lv_obj_add_flag(targets[i], LV_OBJ_FLAG_CLICKABLE);
            lv_obj_set_ext_click_area(targets[i], 8);   // small text → forgiving target
            lv_obj_add_event_cb(targets[i], [](lv_event_t* e) {
                UiManager* self = (UiManager*)lv_event_get_user_data(e);
                if (self && self->currentScreen != ScreenId::NODE_NETWORK)
                    self->showScreen(ScreenId::NODE_NETWORK);
            }, LV_EVENT_CLICKED, this);
        }
    }

    // Wire the alarm bell icon on a non-clock header after build().
    void _wireAlarmIcon(SharedHeaderRefs& hdr) {
        if (!hdr.alarmIcon) return;
        lv_obj_add_flag(hdr.alarmIcon, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(hdr.alarmIcon, 6);
        lv_obj_add_event_cb(hdr.alarmIcon, onAlarmIconTapped, LV_EVENT_CLICKED, this);
    }

    lv_obj_t* buildClockScreen() {
        lv_obj_t* scr = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

        LV_IMG_DECLARE(turbousd_logo);
        lv_obj_t* logo = lv_img_create(scr);
        lv_img_set_src(logo, &turbousd_logo);
        lv_img_set_zoom(logo, 170);   // ~32px
        lv_obj_align(logo, LV_ALIGN_TOP_MID, 0, 10);

        // Date — larger, letter-spaced; tap opens the calendar.
        clockDateLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockDateLabel, lv_color_hex(0xcfcfd4), 0);
        lv_obj_set_style_text_font(clockDateLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_letter_space(clockDateLabel, 3, 0);
        lv_obj_align(clockDateLabel, LV_ALIGN_CENTER, 0, -84);
        lv_obj_add_flag(clockDateLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockDateLabel, 12);
        lv_obj_add_event_cb(clockDateLabel, onDateTapped, LV_EVENT_CLICKED, this);

        // Time — big custom Montserrat font.
        clockTimeLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockTimeLabel, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(clockTimeLabel, &montserrat_clock, 0);
        lv_obj_align(clockTimeLabel, LV_ALIGN_CENTER, 0, -6);

        // Alarm — rounded pill; colour (border + text) follows the alarm state,
        // set each second in updateClockIfNeeded (yellow = on, grey = off).
        clockAlarmLabel = lv_label_create(scr);
        lv_obj_set_style_text_font(clockAlarmLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_radius(clockAlarmLabel, 16, 0);
        lv_obj_set_style_border_width(clockAlarmLabel, 2, 0);
        lv_obj_set_style_border_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_pad_hor(clockAlarmLabel, 16, 0);
        lv_obj_set_style_pad_ver(clockAlarmLabel, 7, 0);
        lv_obj_align(clockAlarmLabel, LV_ALIGN_CENTER, 0, 78);
        lv_obj_add_flag(clockAlarmLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockAlarmLabel, 10);
        lv_obj_add_event_cb(clockAlarmLabel, onAlarmLabelTapped, LV_EVENT_CLICKED, this);

        // Ambient temp/humidity line, e.g. "23° · 48%" (from the RP2040 AHT20).
        clockWeatherLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockWeatherLabel, lv_color_hex(0x9a9a9e), 0);
        lv_obj_set_style_text_font(clockWeatherLabel, &lv_font_montserrat_16, 0);
        lv_obj_align(clockWeatherLabel, LV_ALIGN_CENTER, 0, 64);
        lv_label_set_text(clockWeatherLabel, "--\xC2\xB0 \xE2\x80\xA2 --%");
        lv_obj_add_flag(clockWeatherLabel, LV_OBJ_FLAG_HIDDEN);  // hidden per design; code kept

        clockFooterRefs = buildSharedFooter(scr, onQrTapped, this);
        _wireFooterNav(clockFooterRefs);

