TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        lv_obj_t* daysRow = lv_obj_create(card);
        lv_obj_set_size(daysRow, LV_PCT(100), 36);
        lv_obj_set_style_bg_opa(daysRow, LV_OPA_0, 0);
        lv_obj_set_style_border_width(daysRow, 0, 0);
        lv_obj_set_style_pad_all(daysRow, 0, 0);
        lv_obj_set_style_pad_column(daysRow, 4, 0);
        lv_obj_clear_flag(daysRow, LV_OBJ_FLAG_SCROLLABLE);   // taps only — no stray scrolling
        lv_obj_set_flex_flow(daysRow, LV_FLEX_FLOW_ROW);
        lv_obj_set_flex_align(daysRow, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

        for (int pos = 0; pos < 7; pos++) {
            uint8_t bitIdx = dayOrder[pos];

            lv_obj_t* tile = lv_btn_create(daysRow);
            lv_obj_set_size(tile, 32, 32);
            lv_obj_set_style_radius(tile, 6, 0);
            lv_obj_set_style_pad_all(tile, 0, 0);

            bool active = (sDayMask >> bitIdx) & 1;
            lv_obj_set_style_bg_color(tile, lv_color_hex(active ? 0xe8b339 : 0x1a1a1a), 0);
            lv_obj_set_style_border_color(tile, lv_color_hex(active ? 0xe8b339 : 0x3a3a3a), 0);
            lv_obj_set_style_border_width(tile, 1, 0);

            lv_obj_t* lbl = lv_label_create(tile);
            lv_label_set_text(lbl, dayLabels[pos]);
            lv_obj_set_style_text_font(lbl, &lv_font_montserrat_12, 0);
            lv_obj_set_style_text_color(lbl, lv_color_hex(active ? 0x000000 : 0x6e7280), 0);
            lv_obj_center(lbl);

            // Store bit index in user data; tile's child label is lbl
            lv_obj_set_user_data(tile, (void*)(intptr_t)bitIdx);
            lv_obj_add_event_cb(tile, [](lv_event_t* ev) {
                lv_obj_t* t = lv_event_get_current_target(ev);
                uint8_t bit = (uint8_t)(intptr_t)lv_obj_get_user_data(t);
                // Toggle bit
                sDayMask ^= (1u << bit);
                bool nowActive = (sDayMask >> bit) & 1;
                lv_obj_set_style_bg_color(t, lv_color_hex(nowActive ? 0xe8b339 : 0x1a1a1a), 0);
                lv_obj_set_style_border_color(t, lv_color_hex(nowActive ? 0xe8b339 : 0x3a3a3a), 0);
                lv_obj_t* childLbl = lv_obj_get_child(t, 0);
                if (childLbl) {
                    lv_obj_set_style_text_color(childLbl,
                        lv_color_hex(nowActive ? 0x000000 : 0x6e7280), 0);
                }
            }, LV_EVENT_CLICKED, nullptr);
        }

        // ── Time picker ───────────────────────────────────────────────────────
        // Honour the 12h/24h setting: in AM/PM mode the picker shows 1–12 plus an
        // AM/PM wheel; the hour is decoded back to 0–23 on save.
        bool alarm24h = (storage.getTimeFormat() == "24H");
        TimePickerRefs refs = addTimePicker(card, storage.getAlarmHour(), storage.getAlarmMinute(), alarm24h);

        // ── Alarm on/off toggle ───────────────────────────────────────────────
        static bool sAlarmEnabled;
        sAlarmEnabled = storage.getAlarmEnabled();

        // Keep "ALARM ON" and its switch close together and centred (roughly the
        // same footprint as the two time rollers above), instead of pinned to the
        // far edges of a full-width row.
        lv_obj_t* toggleRow = lv_obj_create(card);
        lv_obj_set_size(toggleRow, LV_SIZE_CONTENT, LV_SIZE_CONTENT);
        lv_obj_set_style_bg_opa(toggleRow, LV_OPA_0, 0);
        lv_obj_set_style_border_width(toggleRow, 0, 0);
        lv_obj_set_style_pad_all(toggleRow, 0, 0);
        lv_obj_set_style_pad_column(toggleRow, 12, 0);
        lv_obj_set_flex_flow(toggleRow, LV_FLEX_FLOW_ROW);
        lv_obj_set_flex_align(toggleRow, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

        lv_obj_t* toggleLbl = lv_label_create(toggleRow);
        lv_label_set_text(toggleLbl, "ALARM ON");
        lv_obj_set_style_text_font(toggleLbl, &lv_font_montserrat_12, 0);
        lv_obj_set_style_text_color(toggleLbl, lv_color_hex(0x9a9a9e), 0);

        lv_obj_t* sw = lv_switch_create(toggleRow);
        lv_obj_set_style_bg_color(sw, lv_color_hex(0xe8b339), LV_PART_INDICATOR | LV_STATE_CHECKED);
        if (sAlarmEnabled) lv_obj_add_state(sw, LV_STATE_CHECKED);
        lv_obj_add_event_cb(sw, [](lv_event_t* ev) {
            sAlarmEnabled = lv_obj_has_state(lv_event_get_target(ev), LV_STATE_CHECKED);
        }, LV_EVENT_VALUE_CHANGED, nullptr);

        // ── Save / Cancel buttons ─────────────────────────────────────────────
        lv_obj_t* btnRow = lv_obj_create(card);
        lv_obj_set_size(btnRow, LV_PCT(100), LV_SIZE_CONTENT);
        lv_obj_set_flex_flow(btnRow, LV_FLEX_FLOW_ROW);
        lv_obj_set_style_pad_column(btnRow, 8, 0);
        lv_obj_set_style_bg_opa(btnRow, LV_OPA_0, 0);
        lv_obj_set_style_border_width(btnRow, 0, 0);

        lv_obj_t* cancelBtn = addModalButton(btnRow, "CANCEL", false);
        lv_obj_t* saveBtn   = addModalButton(btnRow, "SAVE",   true);

        static TimePickerRefs sRefs; static lv_obj_t* sCard;
        sRefs = refs; sCard = card;

        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) {
            uint8_t h = decodePickerHour(sRefs);              // 0–23 regardless of 12/24h mode
            uint8_t m = lv_roller_get_selected(sRefs.minuteRoller);
            storage.setAlarm(h, m, sAlarmEnabled);
            storage.setAlarmDays(sDayMask);
            // Short confirmation beep — doubles as an end-to-end test of the
            // ESP32→RP2040 buzzer link: if saving the alarm chirps, the alarm
            // itself will sound; if it doesn't, the UART link is the problem
            // (not the alarm logic or the buzzer).
            rp2040Link.playChime();
            closeModal(sCard);
        }, LV_EVENT_CLICKED, nullptr);

        lv_obj_add_event_cb(cancelBtn, [](lv_event_t*) {
            closeModal(sCard);
        }, LV_EVENT_CLICKED, nullptr);
    }

    void openCalendarPopup() {
        if (_touchWasSwipe) return;   // a swipe that started on the date — not a tap
        lv_obj_t* card = openModal(lv_scr_act());

        // Custom month grid. LVGL 8's lv_calendar always lays the week out
        // Sunday-first with no option to change it, so we render our own grid
        // that honours the WEEK STARTS setting (Mon or Sun).
        time_t now = time(nullptr);
        struct tm t; localtime_r(&now, &t);
        int year = t.tm_year + 1900;
        int month = t.tm_mon;         // 0..11
        int today = t.tm_mday;

