TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        struct tm first = {};
        first.tm_year = t.tm_year; first.tm_mon = month; first.tm_mday = 1;
        first.tm_hour = 12; first.tm_isdst = -1;
        mktime(&first);
        int firstWday = first.tm_wday;   // 0=Sun..6=Sat

        static const int dimTbl[12] = {31,28,31,30,31,30,31,31,30,31,30,31};
        int daysInMonth = dimTbl[month];
        if (month == 1 && ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0)) daysInMonth = 29;

        bool sunFirst = (storage.getWeekStart() == 0);

        static const char* monthNames[12] = {"JANUARY","FEBRUARY","MARCH","APRIL","MAY","JUNE",
                                             "JULY","AUGUST","SEPTEMBER","OCTOBER","NOVEMBER","DECEMBER"};
        lv_obj_t* title = lv_label_create(card);
        char tbuf[24]; snprintf(tbuf, sizeof(tbuf), "%s %d", monthNames[month], year);
        lv_label_set_text(title, tbuf);
        lv_obj_set_style_text_color(title, lv_color_hex(0xcfcfd4), 0);
        lv_obj_set_style_text_font(title, &lv_font_montserrat_16, 0);

        lv_obj_t* grid = lv_obj_create(card);
        lv_obj_set_size(grid, 7 * 36, LV_SIZE_CONTENT);
        lv_obj_set_style_bg_opa(grid, LV_OPA_0, 0);
        lv_obj_set_style_border_width(grid, 0, 0);
        lv_obj_set_style_pad_all(grid, 0, 0);
        lv_obj_set_style_pad_row(grid, 3, 0);
        lv_obj_set_style_pad_column(grid, 0, 0);   // CRITICAL: the theme's default column
                                                   // gap made 7×36px cells overflow 252px and
                                                   // wrap to 6/row, dropping Sat/Sun. Zero it.
        lv_obj_set_flex_flow(grid, LV_FLEX_FLOW_ROW_WRAP);
        lv_obj_clear_flag(grid, LV_OBJ_FLAG_SCROLLABLE);

        auto makeCell = [&]() -> lv_obj_t* {
            lv_obj_t* c = lv_obj_create(grid);
            lv_obj_set_size(c, 36, 26);
            lv_obj_set_style_bg_opa(c, LV_OPA_0, 0);
            lv_obj_set_style_border_width(c, 0, 0);
            lv_obj_set_style_pad_all(c, 0, 0);
            lv_obj_clear_flag(c, LV_OBJ_FLAG_SCROLLABLE);
            return c;
        };

        static const char* hdrSun[7] = {"S","M","T","W","T","F","S"};
        static const char* hdrMon[7] = {"M","T","W","T","F","S","S"};
        const char** hdr = sunFirst ? hdrSun : hdrMon;
        for (int i = 0; i < 7; i++) {
            lv_obj_t* h = makeCell();
            lv_obj_t* l = lv_label_create(h);
            lv_label_set_text(l, hdr[i]);
            lv_obj_set_style_text_color(l, lv_color_hex(0x6e7280), 0);
            lv_obj_set_style_text_font(l, &lv_font_montserrat_10, 0);
            lv_obj_center(l);
        }

        int offset = sunFirst ? firstWday : (firstWday + 6) % 7;
        for (int i = 0; i < offset; i++) makeCell();   // leading blanks

        for (int d = 1; d <= daysInMonth; d++) {
            lv_obj_t* c = makeCell();
            bool isToday = (d == today);
            if (isToday) {
                lv_obj_set_style_bg_color(c, lv_color_hex(0x2eaa50), 0);
                lv_obj_set_style_bg_opa(c, LV_OPA_COVER, 0);
                lv_obj_set_style_radius(c, LV_RADIUS_CIRCLE, 0);
            }
            lv_obj_t* l = lv_label_create(c);
            char db[4]; snprintf(db, sizeof(db), "%d", d);
            lv_label_set_text(l, db);
            lv_obj_set_style_text_color(l, isToday ? lv_color_hex(0x06150a) : lv_color_hex(0xcfcfd4), 0);
            lv_obj_set_style_text_font(l, &lv_font_montserrat_12, 0);
            lv_obj_center(l);
        }

        lv_obj_t* closeBtn = addModalButton(card, "CLOSE", false);
        static lv_obj_t* sCard; sCard = card;
        lv_obj_add_event_cb(closeBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void openConfigPopup() {
        if (_touchWasSwipe) return;   // a swipe that started on the gear — not a tap
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* title = lv_label_create(card);
        lv_label_set_text(title, "DEVICE SETUP");
        lv_obj_set_style_text_color(title, lv_color_hex(0x9a9a9e), 0);

        // The DEVICE's config QR is the OWNER's entry point: whoever physically
        // holds the device (and sees this screen) is treated as the owner, so it
        // points at the private /setup/ page WITH the per-device secret token
        // (?t=...) — without it the web page refuses to show or save anything,
        // so merely knowing the public 4-char code is no longer enough to edit
        // someone else's node. The PUBLIC profile (/node/<code>) is what the
        // network map / ranking links use instead — see web/app/node/.
        String setupUrl = "https://network.turbousd.com/setup/" + storage.getNodeCode()
                        + "?t=" + storage.getSetupToken();
        addQrCode(card, setupUrl.c_str(), 120);

        // Full URL (incl. token) under the QR, so it can also be typed by hand.
        lv_obj_t* urlHint = lv_label_create(card);
        lv_label_set_text(urlHint, setupUrl.c_str());
        lv_obj_set_style_text_color(urlHint, lv_color_hex(0x9a9a9e), 0);
        lv_obj_set_style_text_font(urlHint, &lv_font_montserrat_10, 0);
        lv_label_set_long_mode(urlHint, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(urlHint, LV_PCT(100));
        lv_obj_set_style_text_align(urlHint, LV_TEXT_ALIGN_CENTER, 0);

        lv_obj_t* prefsTitle = lv_label_create(card);
        lv_label_set_text(prefsTitle, "DISPLAY PREFERENCES");
        lv_obj_set_style_text_color(prefsTitle, lv_color_hex(0x9a9a9e), 0);

        // TEMPERATURE toggle intentionally removed: the base D1 has no environmental
        // sensor and we no longer surface temp/humidity anywhere, so a °C/°F choice
        // would be a dead setting. (setTempUnit still exists for geo-locale use.)

        // Any manual change here locks locale, so the geo-IP autodetect can
        // never later overwrite the user's explicit choice (setLocaleLocked).
        addPrefToggleRow(card, "DATE FORMAT", "DD/MM", "MM/DD",
                          storage.getDateFormat() == "DD/MM",
                          [](bool leftActive){ storage.setDateFormat(leftActive ? "DD/MM" : "MM/DD"); storage.setLocaleLocked(true); });

        addPrefToggleRow(card, "TIME FORMAT", "24H", "AM/PM",
                          storage.getTimeFormat() == "24H",
                          [](bool leftActive){ storage.setTimeFormat(leftActive ? "24H" : "AMPM"); storage.setLocaleLocked(true); });

