TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        addPrefToggleRow(card, "WEEK STARTS", "MON", "SUN",
                          storage.getWeekStart() == 1,
                          [](bool leftActive){ storage.setWeekStart(leftActive ? 1 : 0); storage.setLocaleLocked(true); });

        // Auto screen carousel: cycle through every screen on a timer, looping
        // back to Home. OFF by default. The seconds stepper sets the dwell time
        // per screen. Both push to the web on the next heartbeat (dirty flag).
        // The "ROTATE EVERY" row is only shown while AUTO ROTATE is ON (a
        // function-local static holds it so the toggle's captureless callback can
        // hide/show it, same pattern as sOtaCard below).
        static lv_obj_t* sCarouselSecsRow;
        addPrefToggleRow(card, "AUTO ROTATE", "ON", "OFF",
                          storage.getScreenCarousel(),
                          [](bool leftActive){
                              storage.setScreenCarousel(leftActive);
                              if (sCarouselSecsRow) {
                                  if (leftActive) lv_obj_clear_flag(sCarouselSecsRow, LV_OBJ_FLAG_HIDDEN);
                                  else            lv_obj_add_flag(sCarouselSecsRow, LV_OBJ_FLAG_HIDDEN);
                              }
                          });
        sCarouselSecsRow = addStepperRow(card, "ROTATE EVERY", storage.getScreenCarouselSecs(),
                      5, 120, 5, "s",
                      [](int v){ storage.setScreenCarouselSecs((uint8_t)v); });
        if (!storage.getScreenCarousel())
            lv_obj_add_flag(sCarouselSecsRow, LV_OBJ_FLAG_HIDDEN);

        // Button reference (informational).
        lv_obj_t* btnInfo = lv_label_create(card);
        lv_label_set_text(btnInfo,
            "Top button: tap to toggle the screen, or to silence a ringing alarm. "
            "On the NFT gallery, double-tap for fullscreen (double-tap again to exit).");
        lv_obj_set_style_text_color(btnInfo, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_text_font(btnInfo, &lv_font_montserrat_10, 0);
        // Without wrap the sentence renders on one line and overflows the card
        // sides. Wrap it to the card width and centre it like the notes below.
        lv_label_set_long_mode(btnInfo, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(btnInfo, LV_PCT(100));
        lv_obj_set_style_text_align(btnInfo, LV_TEXT_ALIGN_CENTER, 0);

        // Diagnostics over WiFi (screen mirror + live logs) — at the very bottom.
        // Works even when the USB serial console is unavailable. Shows the
        // mDNS name and the raw IP (Android can't resolve .local → use the IP).
        lv_obj_t* diagInfo = lv_label_create(card);
        {
            String ip = WiFi.localIP().toString();
            String s = String("Logs & screen (same WiFi):\n")
                     + "http://turbousd.local/logs\n"
                     + "http://" + ip + "/logs";
            lv_label_set_text(diagInfo, s.c_str());
        }
        // Same muted tone as the URL under the QR (was bright green, which drew
        // the eye more than the setup URL above it).
        lv_obj_set_style_text_color(diagInfo, lv_color_hex(0x9a9a9e), 0);
        lv_obj_set_style_text_font(diagInfo, &lv_font_montserrat_10, 0);
        lv_label_set_long_mode(diagInfo, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(diagInfo, LV_PCT(100));
        lv_obj_set_style_text_align(diagInfo, LV_TEXT_ALIGN_CENTER, 0);

        // ── FIRMWARE & UPDATES (at the bottom; the card scrolls so it's reachable) ──
        lv_obj_t* verInfo = lv_label_create(card);
        {
            String rpv = rp2040Link.rpVersion();
            char verBuf[80];
            snprintf(verBuf, sizeof(verBuf), "Firmware  ESP32 v%s   RP2040 v%s",
                     FIRMWARE_VERSION, rpv.length() ? rpv.c_str() : RP2040_FIRMWARE_VERSION);
            lv_label_set_text(verInfo, verBuf);
        }
        lv_obj_set_style_text_color(verInfo, lv_color_hex(0x6a6a6e), 0);
        lv_obj_set_style_text_font(verInfo, &lv_font_montserrat_10, 0);
        lv_label_set_long_mode(verInfo, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(verInfo, LV_PCT(100));
        lv_obj_set_style_text_align(verInfo, LV_TEXT_ALIGN_CENTER, 0);

        // Tappable "Check for updates" link (WiFi OTA, no USB). A plain clickable
        // label rather than a big button, per request — sits under the versions.
        lv_obj_t* otaLink = lv_label_create(card);
        // Use an LVGL built-in symbol (it lives in the Montserrat font's symbol
        // range) — the old "»" (U+00BB) isn't in the font and rendered as a
        // "tofu" box. LV_SYMBOL_DOWNLOAD reads clearly as "get the update".
        lv_label_set_text(otaLink, LV_SYMBOL_DOWNLOAD "  Check for updates");
        lv_obj_set_style_text_color(otaLink, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(otaLink, &lv_font_montserrat_12, 0);
        lv_obj_add_flag(otaLink, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(otaLink, 10);   // easier to tap
        static lv_obj_t* sOtaCard; sOtaCard = card;
        lv_obj_add_event_cb(otaLink, [](lv_event_t* e) {
            UiManager* self = (UiManager*)lv_event_get_user_data(e);
            if (self) { self->otaCheckRequested = true; self->showOtaInfo("Checking for updates..."); }
            closeModal(sOtaCard);
        }, LV_EVENT_CLICKED, this);

        lv_obj_t* closeBtn = addModalButton(card, "CLOSE", false);
        static lv_obj_t* sCard; sCard = card;
        lv_obj_add_event_cb(closeBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void openVerifyTooltip() {
        if (_touchWasSwipe) return;   // a swipe that started on the badge — not a tap
        // No bottom button: the modal's corner X closes it, and the freed
        // space goes to the instructions text.
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* label = lv_label_create(card);
        lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label, 290);
        lv_label_set_text(label,
            "Verification pending.\n\n"
            "To get verified:\n"
            "1. Post a video on X showing this node running, tagging @turbousd\n"
            "2. Write your node name on paper, show it matches your screen\n"
            "3. Include the wallet holding your TUSD\n"
            "4. We manually review and whitelist your node");
        lv_obj_set_style_text_color(label, lv_color_hex(0x9a9a9e), 0);
    }


    void reloadDebtHistory(int years) {
        // STATIC, not on the stack: this runs on the 8 KB Arduino loop task, and
        // fetchDebtHistory() below does a TLS handshake (mbedTLS is very
        // stack-hungry). An 80-entry array here is ~1.3 KB of stack that used to
        // sit live DURING the handshake — when the refetch was triggered deep
        // inside updateClockIfNeeded() (a large function that has already eaten
        // stack), the total blew the task stack and the device rebooted. That
        // was the "changing the US-debt timeframe dropdown crashes" bug (the
        // SINCE/RATE dropdowns never refetch, so they were fine; the very first
        // 50Y load comes from the small updateDebtData() path, so it survived).
        // Only the loop task calls this, so a static buffer is safe (no reentry).
        static DebtHistoryPoint points[80];
        int count = apiClient.fetchDebtHistory(years, points, 80);
        Log.printf("debtHistory: %d points (years=%d) stackHWM=%u heap=%u\n",
                      count, years, (unsigned)uxTaskGetStackHighWaterMark(NULL),
                      (unsigned)ESP.getFreeHeap());
        if (count == 0) {
            Log.println("reloadDebtHistory: no data returned, leaving chart as-is.");
            return;
        }
        // Find the data's min/max so we can (a) fit the Y axis to it and (b) fill
        // the axis legend.
        double minUsd = points[0].totalDebtUsd, maxUsd = points[0].totalDebtUsd;
        for (int i = 1; i < count; i++) {
            if (points[i].totalDebtUsd < minUsd) minUsd = points[i].totalDebtUsd;
            if (points[i].totalDebtUsd > maxUsd) maxUsd = points[i].totalDebtUsd;
        }

        lv_chart_set_point_count(debtScreen.getChart(), count);
        // Fit the Y axis to the data. lv_chart's DEFAULT range is 0..100, but our
        // scaled values are ~200..365 (tenths of a trillion), so without this the
        // whole series was clipped to a flat line pinned at the top of the chart.
        lv_coord_t loScaled = (lv_coord_t)(minUsd / 1e11);
        lv_coord_t hiScaled = (lv_coord_t)(maxUsd / 1e11);
        if (hiScaled <= loScaled) hiScaled = loScaled + 1;
        lv_coord_t pad = (hiScaled - loScaled) / 12 + 1;   // small headroom so it isn't glued to the edges
        lv_coord_t lo  = loScaled - pad;
        if (lo < 0) lo = 0;   // debt can't be negative — the bottom tick used to read "$-3T"
        lv_chart_set_range(debtScreen.getChart(), LV_CHART_AXIS_PRIMARY_Y, lo, hiScaled + pad);

        for (int i = 0; i < count; i++) {
            // Scale to an integer-friendly range for lv_chart (raw USD values
            // are far too large for lv_coord_t); express in tenths of a
            // trillion so the chart's y-axis still reads meaningfully.
            lv_coord_t scaled = (lv_coord_t)(points[i].totalDebtUsd / 1e11);
            lv_chart_set_next_value(debtScreen.getChart(), debtScreen.getSeries(), scaled);
        }
        debtScreen.updateAxisLegend(points[0].year, points[count - 1].year, minUsd, maxUsd);

        // Derive a real annual $ debasement rate from the debt's growth over the
        // loaded span, for the inflation game. (Compound annual growth rate.)
        if (count >= 2 && points[count - 1].year > points[0].year && points[0].totalDebtUsd > 0) {
            double growth = points[count - 1].totalDebtUsd / points[0].totalDebtUsd;
            int span = points[count - 1].year - points[0].year;
            double r = pow(growth, 1.0 / span) - 1.0;
            if (r > 0.005 && r < 0.6) _annualDebasementRate = r;
        }
        _updateGameProjection();
        // Derive the debt-clock rate ($/sec) from the most recent year-over-year
        // change, then refresh the SINCE / RATE widgets.
        if (count >= 2) {
            double dDebt  = points[count - 1].totalDebtUsd - points[count - 2].totalDebtUsd;
            int    dYears = points[count - 1].year - points[count - 2].year;
            if (dYears < 1) dYears = 1;
            _debtPerSecond = dDebt / (dYears * 365.25 * 86400.0);
            _computeDebtDerived();
        }
        _debtHistLoaded = true;
    }

    // Fill the SINCE / RATE value labels + button labels from the computed rate.
    void _computeDebtDerived() {
        static const long unitSec[]   = {1, 60, 3600, 86400};                 // SEC MIN HOUR DAY
        static const long periodSec[] = {3600, 86400, 604800, 2592000};       // 1H 24H 7D 30D
        debtScreen.updateRateValue(_debtPerSecond * unitSec[rateUnitIndex % 4]);
        long secs = (sincePeriodIndex < 4) ? periodSec[sincePeriodIndex]
                                            : (long)(millis() / 1000);          // "NODE ON" ≈ uptime
        // Full comma-separated figure; recomputed every second so it climbs live.
        debtScreen.updateSinceValue(_debtPerSecond * secs);

        // (Dropdowns render their own selected option — no label plumbing.)
    }

    // NOTE on both pickers below: the selection applies LIVE as the roller
    // moves (VALUE_CHANGED), not only on SAVE — users closed the modal with
    // the X expecting their pick to stick, and it silently reverted.


    // Recompute the inflation-game projection ($10,000 eroded by the real annual
    // debasement rate over the selected horizon) and redraw its chart + labels.
    void _updateGameProjection() {
        static const int yearOpts[10] = {0, 1, 3, 5, 10, 20, 30, 50, 75, 100};
        int years = yearOpts[gameYearsIndex % 10];   // 0 = REAL TIME
        double rate = _annualDebasementRate;

        lv_obj_t* c = gameScreen.getChart();
        lv_chart_series_t* s = gameScreen.getSeries();

        if (years == 0) {
            // ── REAL TIME ── rolling 2-minute window, one point per second,
            // fed by _tickGameRealtime(). Chart units are 0.0001 $ offsets
            // from a baseline so the ~$0.000024/s fall is visible on an
            // integer axis. Re-entering resets the window so the line draws
            // itself from scratch.
            if (!_gameRtActive) {
                _gameRtActive   = true;
                _gameRtBaseline = 0.0;   // set on the first tick
                _gameRtCount    = 0;     // draw from the LEFT edge
                lv_chart_set_point_count(c, GAME_RT_POINTS);
                lv_chart_set_update_mode(c, LV_CHART_UPDATE_MODE_SHIFT);
                lv_chart_set_all_value(c, s, LV_CHART_POINT_NONE);
            }
            _tickGameRealtime();         // draw/refresh immediately
            return;
        }

